In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('data/starbucks.csv', parse_dates=True, index_col='Date')
df.head()

              Close    Volume
Date
2015-01-02  38.0061   6906098
2015-01-05  37.2781  11623796
2015-01-06  36.9748   7664340
2015-01-07  37.8848   9732554
2015-01-08  38.4961  13170548

In [4]:
df.tail()

            Close    Volume
Date
2018-12-24  60.56   6323252
2018-12-26  63.08  16646238
2018-12-27  63.20  11308081
2018-12-28  63.39   7712127
2018-12-31  64.40   7690183

## .shift() forward
This method shifts the entire date index a given number of rows, without regard for time periods (months & years).<br>It returns a modified copy of the original DataFrame.
<br>NOTE: You will lose that last piece of data that no longer has an index!

In [13]:
df.shift(1).head()

              Close      Volume
Date
2015-01-02      NaN         NaN
2015-01-05  38.0061   6906098.0
2015-01-06  37.2781  11623796.0
2015-01-07  36.9748   7664340.0
2015-01-08  37.8848   9732554.0

## .shift() backwards

In [10]:
df.shift(-3).tail()

            Close     Volume
Date
2018-12-24  63.39  7712127.0
2018-12-26  64.40  7690183.0
2018-12-27    NaN        NaN
2018-12-28    NaN        NaN
2018-12-31    NaN        NaN

## Shifting based on Time Series Frequency Code

We can choose to shift <em>index values</em> up or down without realigning the data by passing in a <strong>freq</strong> argument.<br>
This method shifts dates to the next period based on a frequency code. Common codes are 'M' for month-end and 'A' for year-end. <br>Refer to the <em>Time Series Offset Aliases</em> table from the Time Resampling

In [11]:
df.shift(periods=1, freq='M').head()

              Close    Volume
Date
2015-01-31  38.0061   6906098
2015-01-31  37.2781  11623796
2015-01-31  36.9748   7664340
2015-01-31  37.8848   9732554
2015-01-31  38.4961  13170548

all the data is moved to the end of every month

In [17]:
df.shift(periods=2, freq='M').head()

              Close    Volume
Date
2015-02-28  38.0061   6906098
2015-02-28  37.2781  11623796
2015-02-28  36.9748   7664340
2015-02-28  37.8848   9732554
2015-02-28  38.4961  13170548

all the data is moved to end of next month as period is 2

In [20]:
df.shift(periods=1, freq='D').head()

              Close    Volume
Date
2015-01-03  38.0061   6906098
2015-01-06  37.2781  11623796
2015-01-07  36.9748   7664340
2015-01-08  37.8848   9732554
2015-01-09  38.4961  13170548

similary data is moved to the next day